# Taps
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"

# CLI apps
brew "ansible"                          # Ansible CLI
brew "ansible-lint"                     # Ansible linting
brew "argocd"                           #     
brew "cairo"                            # 
brew "coreutils"                        # 
brew "docker"                           # Running containers
brew "direnv"                           # dir-level env vars
brew "espeak"                           # 
brew "ffmpeg"                           # 
brew "fluxcd/tap/flux"                  # 
brew "fortune"                          # 
brew "fping"                            # 
brew "get_iplayer"                      # Download iPlayer programmes
brew "git"                              # It's git, innit
brew "go"                               # Go language
brew "helm"                             # helm charts
brew "jq"                               # json parsing
brew "kubernetes-cli"                   # 
brew "kustomize"                        # 
brew "lolcat"                           # lolcats
brew "macvim"                           # 
brew "mas"                              # 
brew "mutt"                             # 
brew "neofetch"                         # 
brew "nmap"                             # 
brew "nvm"                              # 
brew "python@3.12"                      # 
brew "qrencode"                         #
brew "rename"                           #
brew "rsync"                            # 
brew "telnet"                           # 
brew "terraform"                        # 
brew "tmux"                             # 
brew "tree"                             # 
brew "unbound"                          # 
brew "watch"                            # Run commands at intervals
brew "wget"                             # 
brew "yq"                               # 
brew "yt-dlp"                           # download youtube stuff
brew "zmap"                             # network mapping

# GUI Casks
cask "balenaetcher"                     # For writing images
cask "bitwarden"                        # Password manager
cask "calibre"                          # Ebook manager
cask "firefox"
cask "font-fira-mono-nerd-font"
cask "google-chrome"
cask "grandperspective"
cask "handbrake"
cask "home-assistant"
cask "imageoptim"
cask "iterm2"
cask "jellyfin-media-player"
cask "lulu"
cask "lunar"
cask "mullvadvpn"
cask "multipass"
cask "raspberry-pi-imager"
cask "raspberry-pi-imager"
cask "remarkable"
cask "screenmemory"
cask "slack"
cask "tailscale"
cask "utm"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"


# App Store purchases
mas "Amphetamine", id: 937984704
mas "EasyMQTT", id: 1523099606
mas "iA Writer", id: 775737590
mas "Pixelmator Pro", id: 1289583905
mas "Telegram", id: 747648890
mas "Yoink", id: 457622435

# VS Code extensions
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme-icons"
vscode "equinusocio.vsc-material-theme"
vscode "ikbengeenrobot.ansible-variable-lookup"
vscode "janisdd.vscode-edit-csv"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "wholroyd.jinja"