# Taps
tap "fluxcd/tap"
tap "homebrew/bundle"

# CLI apps
brew "ansible-lint"
brew "ansible"
brew "argocd"
brew "cairo"
brew "coreutils"
brew "direnv"
brew "docker"
brew "espeak"
brew "ffmpeg"
brew "fluxcd/tap/flux"
brew "folderify"
brew "fortune"
brew "fping"
brew "get_iplayer"
brew "git"
brew "go"
brew "helm"
brew "jq"
brew "kubernetes-cli"
brew "kustomize"
brew "lolcat"
brew "macvim"
brew "mas"
brew "mutt"
brew "nmap"
brew "nvm"
brew "python@3.12"
brew "qrencode"
brew "rename"
brew "retry"
brew "rsync"
brew "telnet"
brew "tmux"
brew "tree"
brew "unbound"
brew "watch"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "zmap"

# GUI Casks
cask "balenaetcher"
cask "bitwarden"
cask "calibre"
cask "firefox"
cask "font-fira-mono-nerd-font"
cask "google-chrome"
cask "grandperspective"
cask "handbrake"
cask "home-assistant"
cask "imageoptim"
cask "iterm2"
cask "jellyfin-media-player"
cask "lulu"
cask "lunar"
cask "mullvadvpn"
cask "multipass"
cask "raspberry-pi-imager"
cask "screenmemory"
cask "slack"
cask "tailscale"
cask "utm"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
# App Store purchases
mas "Amphetamine", id: 937984704
mas "EasyMQTT", id: 1523099606
mas "iA Writer", id: 775737590
mas "Pixelmator Pro", id: 1289583905
mas "reMarkable Desktop", id: 1276493162
mas "Telegram", id: 747648890
mas "Yoink", id: 457622435

# VS Code extensions
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme-icons"
vscode "equinusocio.vsc-material-theme"
vscode "ikbengeenrobot.ansible-variable-lookup"
vscode "janisdd.vscode-edit-csv"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "wholroyd.jinja"