# Taps
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"

# CLI apps
brew "ansible"                  # Ansible CLI
brew "argocd"                   #     
brew "cairo"                    # 
brew "coreutils"                # 
brew "direnv"
brew "espeak"                   # 
brew "ffmpeg"                   # 
brew "fluxcd/tap/flux"          # 
brew "fortune"                  # 
brew "fping"                    # 
brew "get_iplayer"              # Download iPlayer programmes
brew "git"                      # It's git, innit
brew "go"                       # Go language
brew "helm"                     # 
brew "jq"                       # 
brew "kubernetes-cli"           # 
brew "kustomize"                # 
brew "lolcat"                   # 
brew "macvim"                   # 
brew "mas"                      # 
brew "mutt"                     # 
brew "neofetch"                 # 
brew "nmap"                     # 
brew "nvm"                      # 
brew "python@3.12"              # 
brew "qrencode"                 #
brew "rename"                   #
brew "rsync"                    # 
brew "telnet"                   # 
brew "terraform"                # 
brew "tmux"                     # 
brew "tree"                     # 
brew "unbound"                  # 
brew "watch"                    # Run commands at intervals
brew "wget"                     # 
brew "yt-dlp"                   # 
brew "yq"                       # 
brew "zmap"                     # 

# GUI Casks
cask "bitwarden"
cask "balenaetcher"
cask "tailscale"
cask "calibre"
cask "docker"
cask "firefox"
cask "font-fira-mono-nerd-font"
cask "google-chrome"
cask "vivaldi"
cask "handbrake"
cask "home-assistant"
cask "imageoptim"
cask "iterm2"
cask "mullvadvpn"
cask "multipass"
cask "raspberry-pi-imager"
cask "remarkable"
cask "slack"
cask "utm"
cask "visual-studio-code"

# App Store purchases
mas "Amphetamine", id: 937984704
mas "EasyMQTT", id: 1523099606
mas "iA Writer", id: 775737590
mas "Pixelmator Pro", id: 1289583905
mas "Telegram", id: 747648890
mas "Yoink", id: 457622435

# VS Code extensions
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "editorconfig.editorconfig"
vscode "ikbengeenrobot.ansible-variable-lookup"
vscode "janisdd.vscode-edit-csv"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "wholroyd.jinja"